app/controllers/events_controller.rb

  def index
    events = Event.all
---
SELECT "events".* FROM "events"

  def show
    event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 14]]

  def update
    event = Event.find(params[:id])
    event.increment!(:people_count)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "events" SET "people_count" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["people_count", 11], ["updated_at", "2015-02-18 00:44:11.492510"], ["id", 6]]